In [92]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression 
from sklearn import preprocessing

In [67]:
data=pd.read_csv('Downloads/titanic_training.csv',delimiter=',')
df=data.copy(deep=True)
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [68]:
df.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)

In [69]:
df.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Fare          0
Embarked      1
Survived      0
dtype: int64

In [70]:
df=df.dropna()

In [71]:
target=df.Survived

In [72]:
df.drop('Survived',axis=1,inplace=True)

In [73]:
df.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       2  female  29.0      1      0  26.0000        S
2       2    male  39.0      0      0  26.0000        S
3       3  female  29.0      0      4  21.0750        S
4       3    male  25.0      0      0   7.0500        S
5       3    male  34.5      0      0   6.4375        C

In [74]:
def dummvar(s):
    if s=='male':
        return 0
    else:
        return 1
def dummvar2(s):
    if s=='S':
        return 0
    else:
        return 1

In [75]:
df['Sex']=df.Sex.apply(dummvar)
df['Embarked']=df.Embarked.apply(dummvar2)

In [76]:
df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       2    1  29.0      1      0  26.0000         0
2       2    0  39.0      0      0  26.0000         0
3       3    1  29.0      0      4  21.0750         0
4       3    0  25.0      0      0   7.0500         0
5       3    0  34.5      0      0   6.4375         1

In [78]:
#extras
df["age_age"]=df['Age']*df['Age']
df["pclass_pclass"]=df['Pclass']*df['Pclass']
df["Pclass_Age"]=df['Pclass']*df['Age']
df["Embarked_pclass"]=df['Embarked']*df['Pclass']
df["Embarked_pclass_age"]=df['Embarked']*df['Pclass']*df['Age']
df.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,age_age,pclass_pclass,Pclass_Age,Embarked_pclass,Embarked_pclass_age
0,2,1,29.0,1,0,26.0000,0,841.00,4,58.0,0,0.0
2,2,0,39.0,0,0,26.0000,0,1521.00,4,78.0,0,0.0
3,3,1,29.0,0,4,21.0750,0,841.00,9,87.0,0,0.0
4,3,0,25.0,0,0,7.0500,0,625.00,9,75.0,0,0.0
5,3,0,34.5,0,0,6.4375,1,1190.25,9,103.5,3,103.5

In [79]:
scaler=preprocessing.StandardScaler()

In [80]:
scaler.fit(df)

StandardScaler()

In [82]:
clf=LogisticRegression(solver='lbfgs')

# Training data

In [83]:
clf.fit(df,target)

C:\Users\user\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:762: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

# test data

In [86]:
test_data=pd.read_csv('Downloads/0000000000002429_test_titanic_x_test.csv',delimiter=',')
df2=test_data.copy(deep=True)
df2.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)
df2['Sex']=df2.Sex.apply(dummvar)
df2['Embarked']=df2.Embarked.apply(dummvar2)
df2.head()
df2.isnull().sum()
df2.Age.fillna(df['Age'].mean(),inplace=True)
df2["age_age"]=df2['Age']*df2['Age']
df2["pclass_pclass"]=df2['Pclass']*df2['Pclass']
df2["Pclass_Age"]=df2['Pclass']*df2['Age']
df2["Embarked_pclass"]=df2['Embarked']*df2['Pclass']
df2["Embarked_pclass_age"]=df2['Embarked']*df2['Pclass']*df2['Age']

In [89]:
ans=clf.predict(df2)

In [90]:
ans

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0,
       1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [88]:
clf.score(df,target)

0.7850467289719626

In [93]:
np.savetxt("solution.csv",ans,delimiter=",")